of_coupling/of-original/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    outlet
    {
        //type            coupledPressure;
        //refValue           uniform 0;
        type                coupledPressure;
        refValue           uniform 0;
        //type            fixedValue;
        //value           uniform 0;
        //type              fixedGradient;
        //gradient          uniform 0;
        //type            zeroGradient; 
        //type            prghTotalPressure;
        //p0              $internalField;
    }
    walls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    atmosphere
    {
        //type            fixedFluxPressure;
        //value           $internalField;
        type            prghTotalPressure;
        p0              $internalField;
        //type            fixedFluxPressure;
        //value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
